Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: The bounding rectangle bounds will be large enough to enclose the path when the path is drawn with the specified pen.
fr: Les limites du rectangle délimitant seront suffisamment grandes pour englober le GraphicsPath quand il sera dessiné avec le crayon spécifié.

source: an array containing the rectangle coordinates and dimensions:
fr: Retourne un tableau contenant les coordonnées du rectangle et ses dimensions:

source: [0] - Rectangle X position
fr: [0] - Coordonnée X du rectangle

source: [1] - Rectangle Y position
fr: [1] - Coordonnée Y du rectangle

source: [2] - Rectangle Width
fr: [2] - Largeur du rectangle

source: [3] - Rectangle Height
fr: [3] - Hauteur du rectangle

source: Search GdipGetPathWorldBounds in MSDN Library
fr: Consultez GdipGetPathWorldBounds dans la Librairie MSDN.

source: Determines whether a specified point touches the outline of a path with the specified Graphics and Pen
fr: Détermine si un point spécifié touche le contour d'un GraphicsPath lorsqu'il est dessiné à l'aide d'un Pen et d'un Graphics spécifiés

source: X coordinate of the point to test
fr: Coordonnée X du point à tester

source: Y coordinate of the point to test
fr: Coordonnée Y du point à tester

source: Pointer to a Pen object that define the width of point to test.
fr: Handle de l'objet Pen qui définit la largeur du point à tester.

source: Pointer to a Graphics object that specifies a world-to-device transformation.
fr: Handle de l'objet Graphics qui spécifie une transformation des coordonnées universelles en coordonnées du périphérique.

source: If 0, the test is
fr: Si 0, le test est

source: True if the point touches the outline of the path,
fr: Retourne True si le point spécifié touche le contour du GraphicsPath,

source: False otherwise.
fr: False sinon.

source: Search GdipIsOutlineVisiblePathPoint in MSDN Library
fr: Consultez GdipIsOutlineVisiblePathPoint dans la Librairie MSDN.

source: Determines whether a specified point lies in the area that is filled when a path is filled by a specified Graphics object
fr: Détermine si le point spécifié se trouve dans la zone qui est colorée lorsqu'un GraphicsPath est coloré par un objet Graphics spécifié

source: True if the point lies in the interior of the path, False otherwise
fr: Retourne True si le point se trouve à l'intérieur du tracé, False sinon

source: Search GdipIsVisiblePathPoint in MSDN Library
fr: Consultez GdipIsVisiblePathPoint dans la Librairie MSDN.

source: Releases a GraphicsPathIterator object
fr: Libère un objet GraphicsPathIterator

source: Pointer to a GraphicsPath object that will be associated with this GraphicsPathIterator object
fr: Handle de l'objet GraphicsPath associé à l'objet GraphicsPathIterator

source: Search GdipDeletePathIter in MSDN Library
fr: Consultez GdipDeletePathIter dans la Librairie MSDN.

source: Path to get the subpath figure
fr: Path pour obtenir les figures du sous-tracé

source: reset path transformation
fr: Réinitialise la transformation du tracé

source: Gets the number of subpaths (also called figures) in the path
fr: Obtient le nombre de sous-tracés (également appelés figures) dans un tracé (GraphicsPath)

source: Pointer to a GraphicsPathIterator object
fr: Handle de l'objet GraphicsPathIterator

source: the number of subpaths in the path.
fr: Retourne le nombre de sous-tracés dans le GraphicsPath.

source: Search GdipPathIterGetSubpathCount in MSDN Library
fr: Consultez GdipPathIterGetSubpathCount dans la Librairie MSDN.

source: Gets the next marker-delimited section of an iterator's associated path
fr: Obtient la section suivante, délimitée par un marqueur, d'un tracé (GraphicsPath) associé à un itérateur (GraphicsPathIterator)

source: the number of point in the retrieved section or 0 if no more sections to be retrieved
fr: Retourne le nombre de points dans la section récupéré ou 0 si aucune nouvelle section n'est récupérée.

source: -1 and sets the @error flag to non-zero, @extended may contains GPSTATUS error code ($GDI_ERR*).
fr: Retourne -1 et @error <> 0, @extended contient le code erreur GPSTATUS ($GDI_ERR*).

source: This function sets the data points of the specified GraphicsPath object to match the data points of the retrieved section.
fr: Cette fonction définit les points de données de l'objet GraphicsPath conçu pour correspondre avec les points de données de la section récupérée.

source: Search GdipPathIterNextMarkerPath in MSDN Library
fr: Consultez GdipPathIterNextMarkerPath dans la Librairie MSDN.

source: e.g.The letter A is composed of two sub-paths - compare with _GDIPlus_PathIterNextSubpathPath
fr: Par exemple La lettre A est composé de deux sous-tracés - comparer avec _GDIPlus_PathIterNextSubpathPath

source: No more figures
fr: Pas plus de figures

source: Gets the next figure (subpath) from an iterator's associated path
fr: Obtient la figure (sous-tracé) suivante d'un tracé (GraphicsPath) associé à un itérateur (GraphicsPathIterator)

source: an array containing the number of points in the retrieved figure:
fr: Retourne un tableau contenant le nombre de points de la figure récupérée:

source: [0] - Number of point in the retrieved figure or 0 if no more figures to be retrieved
fr: [0] - Nombre de point de la figure récupérée ou 0 s'il n'y a plus de figure à récupérer

source: [1] - If True, the figure is closed, False otherwise
fr: [1] - True, si la figure est fermée, False sinon

source: This function sets the data points of the specified GraphicsPath object to match the data points of the retrieved figure.
fr: Cette fonction définit les points de données de l'objet spécifié GraphicsPath pour les faire correspondre avec les points de données de la figure récupérée.

source: Search GdipPathIterNextSubpathPath in MSDN Library
fr: Consultez GdipPathIterNextSubpathPath dans la Librairie MSDN.

source: Rewinds an iterator to the beginning of its associated path
fr: Rembobine un itérateur (GraphicsPathIterator) jusqu'au début de son tracé (GraphicsPath) qui lui est associé

source: Search GdipPathIterRewind in MSDN Library
fr: Consultez GdipPathIterRewind dans la Librairie MSDN.

source: Empties a path and sets the fill mode to alternate (0)
fr: Vide un tracé (GraphicsPath) et définit le mode de remplissage à Alternate (0)

source: Search GdipResetPath in MSDN Library
fr: Consultez GdipResetPath dans la Librairie MSDN.

source: Reverses the order of the points that define a path's lines and curves
fr: Inverse l'ordre des points qui définissent les lignes et les courbes d'un tracé (GraphicsPath)

source: Search GdipReversePath in MSDN Library
fr: Consultez GdipReversePath dans la Librairie MSDN.

source: Sets the fill mode of a path
fr: Définit le mode de remplissage d'un tracé (GraphicsPath)

source: Path fill mode:
fr: Mode de remplissage du tracé:

source: Search GdipSetPathFillMode in MSDN Library
fr: Consultez GdipSetPathFillMode dans la Librairie MSDN.

source: Designates the last point in a path as a marker point
fr: Désigne le dernier point d'un tracé (GraphicsPath) comme point marqueur

source: A path can have markers that divide the path into sections.
fr: Un tracé peut avoir des marqueurs qui divisent le tracé en sections.

source: You can use a GraphicsPathIterator object to isolate one or more of those sections.
fr: Vous pouvez utiliser un objet GraphicsPathIterator afin d'isoler une ou plusieurs de ces sections.

source: Search GdipSetPathMarker in MSDN Library
fr: Consultez GdipSetPathMarker dans la Librairie MSDN.

source: Starts a new figure without closing the current figure.
fr: Démarre une nouvelle figure sans fermer la figure actuelle.

source: Subsequent points added to a path are added to the new figure
fr: Les points ajoutés au tracé sont alors ajoutés à la nouvelle figure

source: Search GdipStartPathFigure in MSDN Library
fr: Consultez GdipStartPathFigure dans la Librairie MSDN.

source: next line will not be connected to last point
fr: La ligne suivante ne sera pas reliée au dernier point

source: Multiplies each of a path's data points by a specified matrix
fr: Multiplie chacun des points de données d'un tracé (GraphicsPath) par une matrice spécifiée

source: Pointer to a Matrix object that specifies the transformation
fr: Handle de l'objet Matrix qui définit la transformation

source: Search GdipTransformPath in MSDN Library
fr: Consultez GdipTransformPath dans la Librairie MSDN.

source: Replaces a path with curves that enclose the area that is filled when the path is drawn by a specified pen.
fr: Remplace un tracé (GraphicsPath) par des courbes qui entourent la zone remplie lorsque ce tracé est dessiné avec un crayon spécifié.

source: The function also flattens the path
fr: La fonction aplatit aussi le tracé.

source: Pointer to a Pen object.
fr: Handle du crayon.

source: The path is made as wide as it would be when drawn by this pen.
fr: Le tracé est définit aussi large qu'il le serait s'il était dessiné avec ce crayon.

source: Pointer to a Matrix object that represents a transformation to be applied along with the widening.
fr: Handle de l'objet Matrix qui représente une transformation à appliquer en même temps que l'élargissement.

source: If 0, no transformation is applied
fr: Si 0, aucune transformation n'est appliquée

source: Search GdipWidenPath in MSDN Library
fr: Consultez GdipWidenPath dans la Librairie MSDN.

source: Transforms and flattens a path, and then converts the path's data points so that they represent only the outline of the path
fr: Transforme et aplatit un tracé (GraphicsPath), puis convertit les points de données du tracé de sorte qu'ils ne représentent que le contour du tracé

source: Pointer to a Matrix object that specifies the transformation.
fr: Handle de l'objet Matrix qui spécifie la transformation.

source: Reducing the flatness increases the number of line segments in the approximation.
fr: Une planéité faible augmente le nombre de segments de droite dans l'approximation.

source: Search GdipWindingModeOutline in MSDN Library
fr: Consultez GdipWindingModeOutline dans la Librairie MSDN.

source: Create a pen object
fr: Crée un objet crayon

source: Alpha, Red, Green and Blue components of pen color
fr: Code couleur du crayon: composantes Alpha, Rouge, Vert et Bleu

source: The width of the pen measured in the units specified in the $iUnit parameter
fr: Largeur du crayon mesurée dans l'unité spécifiée dans le paramètre $iUnit

source: Unit of measurement for the pen size:
fr: Unité de mesure de la largeur du crayon:

source: a handle to a pen object.
fr: Retourne le handle d'un objet crayon.

source: When you are done with the pen, call _GDIPlus_PenDispose() to release the resources.
fr: Lorsque vous en avez terminé avec le crayon, appelez _GDIPlus_PenDispose() pour libérer les ressources.

source: Search GdipCreatePen1 in MSDN Library
fr: Cherchez GdipCreatePen1 dans la Library MSDN.

source: draw ellipse
fr: dessiner une ellipse

source: draw line
fr: Trace une ligne

source: Creates a Pen object that uses the attributes of a brush
fr: Crée un objet crayon qui utilise les attributs d'un pinceau

source: Pointer to a brush object to base this pen on
fr: Handle de l'objet pinceau

source: a pointer to a new Pen object.
fr: Retourne le handle d'un nouvel objet Pen.

source: After you are done with the object, call _GDIPlus_PenDispose() to release the object resources.
fr: Après que voous en ayez terminé avec l'objet, appelez _GDIPlus_PenDispose() pour libérer les ressources de l'objet.

source: Search GdipCreatePen2 in MSDN Library
fr: Cherchez GdipCreatePen2 dans la Library MSDN.

source: Release a pen object
fr: Libère les ressources de l'objet Pen

source: Handle to a pen object
fr: Handle de l'objet Pen

source: Search GdipDeletePen in MSDN Library
fr: Cherchez GdipDeletePen dans la Library MSDN.

source: Gets the pen alignment
fr: Obtient l'alignement du crayon

source: the alignment type:
fr: Retourne le type d'alignement:

source: 0 - Specifies that the pen is aligned on the center of the line that is drawn
fr: 0 - Spécifie que le crayon est aligné sur le centre de la ligne dessinée

source: 1 - Specifies, when drawing a polygon, that the pen is aligned on the inside of the edge of the polygon
fr: 1 - Spécifie, lors de l'élaboration d'un polygone, que le crayon est aligné à l'intérieur du bord du polygone

source: Search GdipGetPenMode in MSDN Library
fr: Cherchez GdipGetPenMode dans la Library MSDN.

source: Show pen alignment
fr: Affiche l'alignement du crayon

source: Gets the pen color
fr: Obtient la couleur d'un crayon

source: the pen color.
fr: Retourne la couleur du crayon.

source: Search GdipGetPenColor in MSDN Library
fr: Cherchez GdipGetPenColor dans la Library MSDN.

source: Gets the custom end cap for the pen
fr: Obtient l'embout personnalisé d'un crayon

source: a handle to a CustomLineCap object that specifies the pen custom end cap.
fr: Retourne le handle d'un objet CustomLineCap qui caractèrise l'embout personnalisé du crayon.

source: Search GdipGetPenCustomEndCap in MSDN Library
fr: Cherchez GdipGetPenCustomEndCap dans la Library MSDN.

source: Gets the pen dash cap style
fr: Obtient le style des extrémités des tirets fait par un crayon

source: the dash cap style:
fr: Retourne le style d'embout des tirets:

source: $GDIP_DASHCAPFLAT - A square cap that squares off both ends of each dash
fr: $GDIP_DASHCAPFLAT - Un embout carré termine les deux extrémités de chaque tiret

source: $GDIP_DASHCAPROUND - A circular cap that rounds off both ends of each dash
fr: $GDIP_DASHCAPROUND - Un embout rond termine les deux extrémités de chaque tiret

source: $GDIP_DASHCAPTRIANGLE - A triangular cap that points both ends of each dash
fr: $GDIP_DASHCAPTRIANGLE - Un embout triangulaire termine les deux extrémités de chaque tiret

source: Search GdipGetPenDashCap197819 in MSDN Library
fr: Cherchez GdipGetPenDashCap197819 dans la Library MSDN.

source: Show pen dash cap
fr: Affiche l'embout des tirets du crayon

source: Gets the pen dash style
fr: Obtient le style de trait du crayon

source: the dash style:
fr: Retourne le style de trait:

source: $GDIP_DASHSTYLESOLID - A solid line
fr: $GDIP_DASHSTYLESOLID - Une ligne continue

source: $GDIP_DASHSTYLEDASH - A dashed line
fr: $GDIP_DASHSTYLEDASH - Une ligne de tirets

source: $GDIP_DASHSTYLEDOT - A dotted line
fr: $GDIP_DASHSTYLEDOT - Une ligne en pointillés

source: $GDIP_DASHSTYLEDASHDOT - An alternating dash-dot line
fr: $GDIP_DASHSTYLEDASHDOT - Une ligne qui alterne tiret-point

source: $GDIP_DASHSTYLEDASHDOTDOT - An alternating dash-dot-dot line
fr: $GDIP_DASHSTYLEDASHDOTDOT - Une ligne qui alterne tiret-point-point

source: $GDIP_DASHSTYLECUSTOM - A a user-defined, custom dashed line
fr: $GDIP_DASHSTYLECUSTOM - Une ligne de style personnalisé défini par l'utilisateur

source: Search GdipGetPenDashStyle in MSDN Library
fr: Cherchez GdipGetPenDashStyle dans la Library MSDN

source: Show pen dash style
fr: Affiche le style de trait du crayon

source: Gets the pen end cap
fr: Obtient le style d'embout de ligne affecté au crayon

source: the end cap type:
fr: Retourne le type d'embout:

source: $GDIP_LINECAPFLAT - Specifies a flat cap
fr: $GDIP_LINECAPFLAT - Embout plat

source: $GDIP_LINECAPSQUARE - Specifies a square cap
fr: $GDIP_LINECAPSQUARE - Embout carré

source: $GDIP_LINECAPROUND - Specifies a circular cap
fr: $GDIP_LINECAPROUND - Embout rond

source: $GDIP_LINECAPTRIANGLE - Specifies a triangular cap
fr: $GDIP_LINECAPTRIANGLE - Embout triangulaire

source: $GDIP_LINECAPNOANCHOR - Specifies that the line ends are not anchored
fr: $GDIP_LINECAPNOANCHOR - Les extrémités de la ligne ne sont pas ancrées

source: $GDIP_LINECAPSQUAREANCHOR - Specifies that the line ends are anchored with a square
fr: $GDIP_LINECAPSQUAREANCHOR - Les extrémités de ligne sont ancrées avec un carré

source: $GDIP_LINECAPROUNDANCHOR - Specifies that the line ends are anchored with a circle
fr: $GDIP_LINECAPROUNDANCHOR - Les extrémités de ligne sont ancrées avec un cercle

source: $GDIP_LINECAPDIAMONDANCHOR - Specifies that the line ends are anchored with a diamond
fr: $GDIP_LINECAPDIAMONDANCHOR - Les extrémités de ligne sont ancrées avec un losange

source: $GDIP_LINECAPARROWANCHOR - Specifies that the line ends are anchored with arrowheads
fr: $GDIP_LINECAPARROWANCHOR - Les extrémités de ligne sont ancrés à l'aide d'embout de flèche

source: $GDIP_LINECAPCUSTOM - Specifies that the line ends are made from a CustomLineCap
fr: $GDIP_LINECAPCUSTOM - les extrémités de ligne sont définies à partir d'un CustomLineCap

source: Search GdipGetPenEndCap in MSDN Library
fr: Cherchez GdipGetPenEndCap dans la Library MSDN.

source: Gets the miter length currently set for a Pen object
fr: Obtient la limite de la mitre actuellement fixé pour un crayon

source: Pointer to a Pen object
fr: Handle d'un objet Pen

source: the miter limit of the Pen object.
fr: Retourne la limite de la pointe (formée par l'intersection de deux lignes) de l'objet Pen.

source: The miter length can be large when the angle between two lines is small.
fr: La longueur de la mitre est la distance entre les deux points d'intersection des parois de deux lignes qui se rencontrent.

source: The miter limit is the maximum allowed ratio of miter length to line width.
fr: La longueur de la mitre peut être grande quand l'angle formé par les deux lignes est faible.

source: _GDIPlus_PenSetMiterLimit()
fr: Lien

source: Search GdipGetPenMiterLimit in MSDN Library
fr: Voir aussi

source: Retrieve the width of a pen
fr: Récupére la largeur de tracé d'un crayon

source: the width of pen.
fr: Retourne la largeur du crayon.

source: Search GdipGetPenWidth in MSDN Library
fr: Cherchez GdipGetPenWidth dans la Library MSDN.

source: Show pen width
fr: Affiche la largeur du crayon

source: Sets the pen alignment
fr: Définit l'alignement du crayon

source: [optional]Pen alignment.
fr: [optionnel]Alignement du crayon.

source: Search GdipSetPenMode in MSDN Library
fr: Cherchez GdipSetPenMode dans la Library MSDN.

source: Sets the pen color
fr: Définit la couleur d'un crayon

source: Search GdipSetPenColor in MSDN Library
fr: Cherchez GdipSetPenColor dans la Library MSDN.

source: set smoothing mode (8 X 8 box filter)
fr: Définnit le mode lissage (filtre 8 X 8)

source: Sets the custom end cap for the pen
fr: Définit l'embout personnalisé relatif à un crayon

source: Handle to a CustomLineCap object that specifies the pen custom end cap
fr: Handle d'un objet CustomLineCap qui spécifie l'embout personnalisé du crayon

source: Search GdipSetPenCustomEndCap in MSDN Library
fr: Cherchez GdipSetPenCustomEndCap dans la Library MSDN.

source: Sets the pen dash cap style
fr: Définit le style des extrémités des tirets fait par un crayon

source: Dash cap style.
fr: Style d'embout des tirets.

source: Search GdipSetPenDashCap197819 in MSDN Library
fr: Cherchez GdipSetPenDashCap197819 dans la Library MSDN.

source: Sets the pen dash style
fr: Définit le style de trait du crayon

source: Dash style.
fr: Style de trait.

source: Search GdipSetPenDashStyle in MSDN Library
fr: Cherchez GdipSetPenDashStyle dans la Library MSDN.

source: Sets the pen end cap
fr: Définit le style d'embout de ligne affecté au crayon

source: End cap type.
fr: Type d'embout.

source: Search GdipSetPenEndCap in MSDN Library
fr: Cherchez GdipSetPenEndCap dans la Library MSDN.

source: Sets the cap styles for the start, end, and dashes in a line drawn with the pen
fr: Définit les styles d'embout de ligne pour le début et la fin, ainsi que les tirets de la ligne tracée avec le crayon

source: Line cap style for the start cap:
fr: Style d'embout pour l'extrémité de départ de la ligne:

source: 0x00 - Line ends at the last point.
fr: 0x00 - La ligne se termine au dernier point.

source: The end is squared off
fr: La fin est d'équerre

source: 0x01 - Square cap.
fr: 0x01 - Embout carré.

source: The center of the square is the last point in the line.
fr: Le centre du carré est le dernier point de la ligne.

source: The height and width of the square are the line width.
fr: Le coté du carré est la largeur de la ligne.

source: 0x02 - Circular cap.
fr: 0x02 - Embout circulaire.

source: The center of the circle is the last point in the line.
fr: Le centre du cercle est le dernier point de la ligne.

source: The diameter of the circle is the line width.
fr: Le diamètre du cercle est la largeur de la ligne.

source: 0x03 - Triangular cap.
fr: 0x03 - Embout triangulaire.

source: The base of the triangle is the last point in the line.
fr: La base du triangle est le dernier point de la ligne.

source: The base of the triangle is the line width.
fr: La base du triangle est la largeur de la ligne.

source: 0x10 - Line ends are not anchored.
fr: 0x10 - Les extrémités de ligne ne sont pas ancrés.

source: 0x11 - Line ends are anchored with a square.
fr: 0x11 - Les extrémités de ligne sont ancrés avec un carré.

source: 0x12 - Line ends are anchored with a circle.
fr: 0x12 - Les extrémités de ligne sont ancrés par un cercle.

source: The center of the circle is at the last point in the line.
fr: Le centre du cercle est le dernier point de la ligne.

source: The circle is wider than the line.
fr: Le cercle est plus large que la ligne.

source: 0x13 - Line ends are anchored with a diamond (a square turned at 45 degrees).
fr: 0x13 - Les extrémités de ligne sont ancrés avec un losange ( un carré tourné à 45 degrés ).

source: The center of the diamond is at the last point in the line.
fr: Le centre du losange est le dernier point de la ligne.

source: The diamond is wider than the line.
fr: Le losange est plus large que la ligne.

source: 0x14 - Line ends are anchored with arrowheads.
fr: 0x14 - Les extrémités de ligne sont ancrés avec des pointes de flèches.

source: The arrowhead point is located at the last point in the line.
fr: La pointe de la flèche se trouve au dernier point de la ligne.

source: The arrowhead is wider than the line.
fr: La flèche est plus large que la ligne.

source: 0xff - Line ends are made from a CustomLineCap object
fr: 0xff - Les extrémités de ligne sont faites à partir d'un objet CustomLineCap

source: Line cap style for the end cap (same values as $iStartCap)
fr: Style d'embout pour l'extrémité (mêmes valeurs que $iStartCap)

source: Start and end caps for a dashed line:
fr: Embout des pointillés pour une ligne en pointillés :

source: 0 - A square cap that squares off both ends of each dash
fr: 0 - Un embout carré qui équerre les deux extrémités de chaque tiret

source: 2 - A circular cap that rounds off both ends of each dash
fr: 2 - Un embout circulaire qui complète les deux extrémités de chaque tiret

source: 3 - A triangular cap that points both ends of each dash
fr: 3 - Un embout triangulaire qui pointe les deux extrémités de chaque tiret

source: Search GdipSetPenLineCap197819 in MSDN Library
fr: Cherchez GdipSetPenLineCap197819 dans la Library MSDN.

source: Sets the line join for a Pen object
fr: Définit la façon dont deux lignes se rejoignent pour un crayon donné

source: Line join style:
fr: Style des raccords de ligne:

source: 0 - Line join produces a sharp corner or a clipped corner
fr: 0 - Produit un angle aigu ou un coin coupé

source: 1 - Line join produces a diagonal corner.
fr: 1 - Produit un coin en diagonale.

source: 2 - Line join produces a smooth, circular arc between the lines.
fr: 2 - Produit, un arc circulaire lisse entre les lignes.

source: 3 - Line join produces a sharp corner or a clipped corner
fr: 3 - Produit un angle aigu ou un coin coupé

source: Search GdipSetPenLineJoin in MSDN Library
fr: Cherchez GdipSetPenLineJoin dans la Library MSDN.

source: Sets the width of a pen
fr: Définit la largeur de tracé d'un crayon

source: Width of pen
fr: Largeur du crayon
